veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxSrc_reg.h
/** \brief E1C, TOM0 Shared Service Request 3 */
#define SRC_GTM_TOM0_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E1Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM0_3.
* To use register names with standard convension, please use SRC_GTM_TOM0_3.
*/
#define SRC_GTMTOM03 (SRC_GTM_TOM0_3)

/** \brief E20, TOM0 Shared Service Request 4 */
#define SRC_GTM_TOM0_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E20u)
/** Alias (User Manual Name) for SRC_GTM_TOM0_4.
* To use register names with standard convension, please use SRC_GTM_TOM0_4.
*/
#define SRC_GTMTOM04 (SRC_GTM_TOM0_4)

/** \brief E24, TOM0 Shared Service Request 5 */
#define SRC_GTM_TOM0_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E24u)
/** Alias (User Manual Name) for SRC_GTM_TOM0_5.
* To use register names with standard convension, please use SRC_GTM_TOM0_5.
*/
#define SRC_GTMTOM05 (SRC_GTM_TOM0_5)

/** \brief E28, TOM0 Shared Service Request 6 */
#define SRC_GTM_TOM0_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E28u)
/** Alias (User Manual Name) for SRC_GTM_TOM0_6.
* To use register names with standard convension, please use SRC_GTM_TOM0_6.
*/
#define SRC_GTMTOM06 (SRC_GTM_TOM0_6)

/** \brief E2C, TOM0 Shared Service Request 7 */
#define SRC_GTM_TOM0_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E2Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM0_7.
* To use register names with standard convension, please use SRC_GTM_TOM0_7.
*/
#define SRC_GTMTOM07 (SRC_GTM_TOM0_7)

/** \brief E30, TOM1 Shared Service Request 0 */
#define SRC_GTM_TOM1_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E30u)
/** Alias (User Manual Name) for SRC_GTM_TOM1_0.
* To use register names with standard convension, please use SRC_GTM_TOM1_0.
*/
#define SRC_GTMTOM10 (SRC_GTM_TOM1_0)

/** \brief E34, TOM1 Shared Service Request 1 */
#define SRC_GTM_TOM1_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E34u)
/** Alias (User Manual Name) for SRC_GTM_TOM1_1.
* To use register names with standard convension, please use SRC_GTM_TOM1_1.
*/
#define SRC_GTMTOM11 (SRC_GTM_TOM1_1)

/** \brief E38, TOM1 Shared Service Request 2 */
#define SRC_GTM_TOM1_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E38u)
/** Alias (User Manual Name) for SRC_GTM_TOM1_2.
* To use register names with standard convension, please use SRC_GTM_TOM1_2.
*/
#define SRC_GTMTOM12 (SRC_GTM_TOM1_2)

/** \brief E3C, TOM1 Shared Service Request 3 */
#define SRC_GTM_TOM1_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E3Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM1_3.
* To use register names with standard convension, please use SRC_GTM_TOM1_3.
*/
#define SRC_GTMTOM13 (SRC_GTM_TOM1_3)

/** \brief E40, TOM1 Shared Service Request 4 */
#define SRC_GTM_TOM1_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E40u)
/** Alias (User Manual Name) for SRC_GTM_TOM1_4.
* To use register names with standard convension, please use SRC_GTM_TOM1_4.
*/
#define SRC_GTMTOM14 (SRC_GTM_TOM1_4)

/** \brief E44, TOM1 Shared Service Request 5 */
#define SRC_GTM_TOM1_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E44u)
/** Alias (User Manual Name) for SRC_GTM_TOM1_5.
* To use register names with standard convension, please use SRC_GTM_TOM1_5.
*/
#define SRC_GTMTOM15 (SRC_GTM_TOM1_5)

/** \brief E48, TOM1 Shared Service Request 6 */
#define SRC_GTM_TOM1_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E48u)
/** Alias (User Manual Name) for SRC_GTM_TOM1_6.
* To use register names with standard convension, please use SRC_GTM_TOM1_6.
*/
#define SRC_GTMTOM16 (SRC_GTM_TOM1_6)

/** \brief E4C, TOM1 Shared Service Request 7 */
#define SRC_GTM_TOM1_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E4Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM1_7.
* To use register names with standard convension, please use SRC_GTM_TOM1_7.
*/
#define SRC_GTMTOM17 (SRC_GTM_TOM1_7)

/** \brief E50, TOM2 Shared Service Request 0 */
#define SRC_GTM_TOM2_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E50u)
/** Alias (User Manual Name) for SRC_GTM_TOM2_0.
* To use register names with standard convension, please use SRC_GTM_TOM2_0.
*/
#define SRC_GTMTOM20 (SRC_GTM_TOM2_0)

/** \brief E54, TOM2 Shared Service Request 1 */
#define SRC_GTM_TOM2_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E54u)
/** Alias (User Manual Name) for SRC_GTM_TOM2_1.
* To use register names with standard convension, please use SRC_GTM_TOM2_1.
*/
#define SRC_GTMTOM21 (SRC_GTM_TOM2_1)

/** \brief E58, TOM2 Shared Service Request 2 */
#define SRC_GTM_TOM2_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E58u)
/** Alias (User Manual Name) for SRC_GTM_TOM2_2.
* To use register names with standard convension, please use SRC_GTM_TOM2_2.
*/
#define SRC_GTMTOM22 (SRC_GTM_TOM2_2)

/** \brief E5C, TOM2 Shared Service Request 3 */
#define SRC_GTM_TOM2_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E5Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM2_3.
* To use register names with standard convension, please use SRC_GTM_TOM2_3.
*/
#define SRC_GTMTOM23 (SRC_GTM_TOM2_3)

/** \brief E60, TOM2 Shared Service Request 4 */
#define SRC_GTM_TOM2_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E60u)
/** Alias (User Manual Name) for SRC_GTM_TOM2_4.
* To use register names with standard convension, please use SRC_GTM_TOM2_4.
*/
#define SRC_GTMTOM24 (SRC_GTM_TOM2_4)

/** \brief E64, TOM2 Shared Service Request 5 */
#define SRC_GTM_TOM2_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E64u)
/** Alias (User Manual Name) for SRC_GTM_TOM2_5.
* To use register names with standard convension, please use SRC_GTM_TOM2_5.
*/
#define SRC_GTMTOM25 (SRC_GTM_TOM2_5)

/** \brief E68, TOM2 Shared Service Request 6 */
#define SRC_GTM_TOM2_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E68u)
/** Alias (User Manual Name) for SRC_GTM_TOM2_6.
* To use register names with standard convension, please use SRC_GTM_TOM2_6.
*/
#define SRC_GTMTOM26 (SRC_GTM_TOM2_6)

/** \brief E6C, TOM2 Shared Service Request 7 */
#define SRC_GTM_TOM2_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E6Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM2_7.
* To use register names with standard convension, please use SRC_GTM_TOM2_7.
*/
#define SRC_GTMTOM27 (SRC_GTM_TOM2_7)

/** \brief EF0, ATOM0 Shared Service Request 0 */
#define SRC_GTM_ATOM0_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EF0u)
/** Alias (User Manual Name) for SRC_GTM_ATOM0_0.
* To use register names with standard convension, please use SRC_GTM_ATOM0_0.
*/
#define SRC_GTMATOM00 (SRC_GTM_ATOM0_0)

